{"id":"ab55b6ee-3017-4263-b44d-05985d30a256","rule_id":"40c4dbca-36c5-4b09-bf45-1d3da839c631","name":"Suspicious Encoded PowerShell Execution","immutable":false,"rule_source":{"type":"internal"},"version":1,"revision":1,"updated_at":"2026-04-02T15:04:09.087Z","updated_by":"2814390330","created_at":"2026-04-01T18:18:01.553Z","created_by":"2814390330","enabled":true,"interval":"5m","from":"now-6m","to":"now","description":"Detects PowerShell execution using the -EncodedCommand flag. This is a common technique used by attackers to bypass basic string-based logging and hide malicious scripts.","tags":["windows","powershell","obfuscation"],"author":[],"license":"","threat":[],"related_integrations":[],"required_fields":[],"setup":"","false_positives":[],"references":[],"risk_score":73,"risk_score_mapping":[],"severity":"high","severity_mapping":[],"output_index":"","max_signals":100,"exceptions_list":[],"actions":[{"id":"89428f40-8a75-4f25-b23e-3bd68ceb01b3","params":{"body":"{\r\n  \"alert_name\": \"{{{context.rule.name}}}\",\r\n  \"time\": \"{{{context.date}}}\",\r\n  \"user\": \"{{{context.hits.0._source.winlog.event_data.User}}}\",\r\n  \"command\": \"{{{context.hits.0._source.winlog.event_data.CommandLine}}}\",\r\n  \"severity\": \"{{{context.rule.severity}}}\",\r\n  \"risk_score\": \"{{{context.rule.risk_score}}}\",\r\n  \"message\": \"Potential malicious activity detected on host: {{{context.hits.0._source.host.name}}}\"\r\n}"},"action_type_id":".webhook","uuid":"7338858d-e558-410d-80ff-10d9f2ab9096","frequency":{"summary":true,"notifyWhen":"onActiveAlert","throttle":null},"group":"default"}],"meta":{"kibana_siem_app_url":"https://my-security-project-c7d2af.kb.us-central1.gcp.elastic.cloud/app/security"},"type":"query","language":"kuery","index":["apm-*-transaction*","auditbeat-*","endgame-*","filebeat-*","logs-*","packetbeat-*","traces-apm*","winlogbeat-*","-*elastic-cloud-logs-*"],"query":"winlog.event_data.CommandLine : *EncodedCommand*","filters":[]}
{"id":"89428f40-8a75-4f25-b23e-3bd68ceb01b3","type":"action","updated_at":"2026-04-02T12:47:37.013Z","created_at":"2026-04-02T12:47:37.013Z","version":"WzI5OCwxXQ==","attributes":{"actionTypeId":".webhook","name":"Tines-SOAR","isMissingSecrets":false,"config":{"url":"https://rustling-wood-8782.tines.com/webhook/your-first-story/11ddb2bb6d5925690b938aa7f27af98f","method":"post","headers":null,"hasAuth":false,"authType":null},"secrets":{}},"references":[],"managed":false,"coreMigrationVersion":"8.8.0","typeMigrationVersion":"10.2.0"}
{"exported_count":2,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":1,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
